app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
        <p><strong>Caption :</strong><%=post.caption%></p>
        <p><strong>User :</strong><%=post.user.first_name%></p>