app/controllers/likes_controller.rb

  def create
    if already_liked?
     render json: {message: "you already like this post"}
    else
      @post.likes.create(user_id: @current_user.id)
      LikeMailer.with(user: @post.user).like_email.deliver_later
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["post_id", 44], ["created_at", "2023-09-07 07:35:11.025252"], ["updated_at", "2023-09-07 07:35:11.025252"]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."id" = ? LIMIT ?  [["post_id", 36], ["id", 11], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def already_liked?
    Like.where(user_id: @current_user.id, post_id: params[:post_id]).exists?
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 36]]
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 4], ["post_id", 44], ["LIMIT", 1]]

  def destroy
    if !(already_liked?)
      flash[:notice] = "Cannot unlike"
    else
      @like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 13]]

  def find_post
    @post = Post.find(params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]

  def find_like
    @like = @post.likes.find(params[:id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."id" = ? LIMIT ?  [["post_id", 44], ["id", 12], ["LIMIT", 1]]