app/controllers/posts_controller.rb

  def index
    @posts=current_user.posts.paginate(:page => params[:page], :per_page => 2)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 21]]

  def show
    posts=@current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["user_id", 2], ["id", 20], ["LIMIT", 1]]

  def create
    post = @current_user.posts.new(post_params)
    if post.save
---
INSERT INTO "posts" ("caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["caption", "post1 caption"], ["user_id", 3], ["created_at", "2023-09-04 13:17:13.411655"], ["updated_at", "2023-09-04 13:17:13.411655"]]

  def update
    post = @current_user.posts.find(params[:id])
    if post.user == @current_user && post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "caption" = ?, "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["caption", "At_home786"], ["image", "mk.jpg"], ["updated_at", "2023-08-16 11:25:07.469897"], ["id", 17]]

  def destroy
    post = @current_user.posts.find(params[:id])
    if post.user == @current_user
      post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["user_id", 11], ["id", 15], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 15]]