app/controllers/users_controller.rb

  def index
    # render json: {message:"Welcome"}
    #render json: current_user
    @users=User.all
---
SELECT "users".* FROM "users"

  def show
    follower_ids = current_user.followers.pluck(:follower_id)
    followee_ids = current_user.followees.pluck(:followee_id)
    post_user_ids = (follower_ids + followee_ids + [current_user.id]).uniq
    @posts = Post.where(user_id: post_user_ids)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" IN (?, ?, ?, ?)  [["user_id", 2], ["user_id", 4], ["user_id", 10], ["user_id", 1]]

  def create
    @user =User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if current_user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2023-08-31 11:52:12.337902"], ["password_digest", "[FILTERED]"], ["id", 1]]

  def unfollow
    user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]