app/models/like.rb

  def create_like_notification
    Notification.create(
    # byebug
    user: post.user,
    notifiable: self,
    notifiable_id: id,
    notifiable_type: 'Like',
    message: "#{user.username} liked your post: #{post.caption}"
   )
---
INSERT INTO "notifications" ("user_id", "notifiable_id", "notifiable_type", "message", "read", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)